test-resources/sample-request.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Header/>
  <env:Body>
    <svc:GetPartTypeRequest xmlns:svc="http://example.com/svc">
      <part>widget</part>
    </svc:GetPartTypeRequest>
  </env:Body>
</env:Envelope>
